changes readme.md file for class diagrams
